-- MySQL dump 10.13  Distrib 8.0.42, for Win64 (x86_64)
--
-- Host: localhost    Database: shlibrary
-- ------------------------------------------------------
-- Server version	8.0.42

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `booktbl`
--

DROP TABLE IF EXISTS `booktbl`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `booktbl` (
  `isbn` int NOT NULL AUTO_INCREMENT,
  `callnum` char(3) NOT NULL,
  `title` varchar(40) NOT NULL,
  `author` varchar(30) NOT NULL,
  `publisher` varchar(30) NOT NULL,
  `pubyear` int NOT NULL,
  `rentnum` int NOT NULL DEFAULT '0',
  PRIMARY KEY (`isbn`)
) ENGINE=InnoDB AUTO_INCREMENT=3004 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `booktbl`
--

LOCK TABLES `booktbl` WRITE;
/*!40000 ALTER TABLE `booktbl` DISABLE KEYS */;
INSERT INTO `booktbl` VALUES (1001,'517','내몸혁명','박용우','루미너스',2024,12),(1002,'511','도파민네이션','애나 렘키','흐름출판',2022,7),(1003,'511','근육연결도감','키마타 료','중앙books',2024,6),(1004,'594','오렌지 베이커리','키티 테이트','윌북',2023,8),(1005,'515','한권으로 끝내는 임플란트','홍순민','군자출판사',2014,4),(1006,'511','당신도 느리게 나이 들 수 있습니다','정희원','더 퀘스트',2023,12),(1007,'511','이토록 뜻밖의 뇌과학','리사 펠드먼 배럿','더 퀘스트',2021,8),(1008,'560','찐초보 걸음마 전기','전병칠','길벗',2024,3),(1009,'540','인문 건축 기행','유현준','을유문화사',2023,5),(1010,'511','인간 탐구 보고서','정재은','아울북',2024,3),(1011,'691','흔한게임','흔한남매','아이세움',2024,3),(1012,'650','명화의 탄생 그때 그 사람','성수영','한경arte',2024,7),(1013,'650','방구석 미술관','조원재','백도씨',2018,12),(1014,'600','아트 인사이트','김영애','마로니에북스',2025,0),(1015,'695','인생은 순간이다','김성근','다산북스',2023,3),(1016,'653','호크니의 그림들','데이비드 호크니','마로니에북스',2024,20),(1017,'623','목각 기법 따라하기','Chris Pye','씨아이알',2016,1),(1018,'688','방구석 영화관','거의없다','왼쪽주머니',2020,3),(1019,'601','미술 이야기','양정무','사회평론',2016,2),(1020,'670','클래식 수업','민은기','사회평론',2018,0),(1021,'740','영어책 한 권 외워봤니?','김민식','위즈덤하우스',2017,7),(1022,'747','영어회화 100','김재우','상상스퀘어',2023,2),(1023,'711','맞춤법 절대 안 틀리는 책 2','빨간내복야코','위즈덤하우스',2024,3),(1024,'711','맞춤법 절대 안 틀리는 책 1','빨간내복야코','위즈덤하우스',2024,2),(1025,'710','불꽃 튀는 우리말','흔한남매','다산어린이',2021,6),(1026,'747','영어는 뻔한 패턴의 반복이다','자하연','씨앤톡',2015,12),(1027,'737','하루 3분 일본어','권선욱','랭귀지북스',2023,17),(1028,'711','이거 완전 아사라비아 한자 1','빨간내복야코','서울문화사',2024,6),(1029,'711','이거 완전 아사라비아 한자 2','빨간내복야코','서울문화사',2024,6),(1030,'714','어린이 감정 표현','한날','파란정원',2024,1),(1031,'813','작별하지 않는다','한강','문학동네',2021,30),(1032,'813','흰','	한강','	문학동네',2018,28),(1033,'814','여행의 이유','김영하','문학동네',2019,25),(1034,'813','희랍어 시간','한강','문학동네',2011,23),(1035,'843','미드나잇 라이브러리','매트 헤이그 지음','인플루엔셜',2021,17),(1036,'813','모순','양귀자','쓰다',2013,16),(1037,'813','바깥은 여름','김애란','문학동네',2017,7),(1038,'813','바람이 분다, 가라','한강','문학과지성사',2010,13),(1039,'813','지구 끝의 온실','김초엽','자이언트북스',2021,4),(1040,'808','긴긴밤','루리','문학동네',2021,8),(1041,'982','오래 준비해온 대답','김영하','복복서가',2020,10),(1042,'911','(5천 년 역사가 단숨에 이해되는) 최소한의 한국사','최태성','	프런트페이지',2023,7),(1043,'981','리얼 도쿄','양미석','한빛라이프',2024,4),(1044,'981','프렌즈 튀르키예(터키)','주종원','중앙books',2023,2),(1045,'980','별난 세계 여행 2 고대 도시','흔한남매','Mirae N 아이세움',2023,6),(1046,'980','별난 세계 여행 3 세계 축제','흔한남매','Mirae N 아이세움',2023,4),(1047,'909','세계사 탐험대 2 페르시아와 그리스 문명','흔한남매','주니어김영사',2024,3),(1048,'909','거꾸로 읽는 세계사','유시민','돌베개',2021,2),(1049,'981','도쿄 호텔 도감','엔도 케이','윌북',2024,1),(1050,'990','Who? 일론 머스크','오기수','다산어린이',2023,2),(2001,'029','메모 독서법','신정철','위즈덤하우스',2019,7),(2002,'001','지적 대화를 위한 넓고 얕은 지식','채사장','웨일북',2020,7),(2003,'005','GitOps cookbook','Vinto Natale','인사이트',2024,6),(2004,'004','랭체인으로 LLM 기반의 AI 서비스 개발하기','서지영','길벗',2024,6),(2005,'011','에디토리얼 씽킹','최혜진','Turtleneck Press',2023,6),(2006,'004','제가 만든 GRT는 당신이 만든 GPT와 전혀 다릅니다','유호석','Re:commend',2024,6),(2007,'005','젠킨스로 배우는 CL/CD 파이프라인 구축','프라노데이 프라모드 딩가레','에이콘출판',2024,6),(2008,'005','챗 GPT로 시작하는 데이터 리터러시','구자룡','마들렌북',2025,6),(2009,'004','(ChatGPT가 직접 쓴) 챗 GPT 입문','장문철','앤써북',2023,5),(2010,'004','(개념 이해로 시작하기 좋은) 최고의 프롬프트 엔지니어링 강의','김진중','Re:commend',2024,5),(2021,'165','마흔에 읽는 니체','장재형','유노',2022,20),(2022,'188','자평진전','심효첨','문원복',2020,15),(2023,'182','행복의 기원','서은국','21세기북스',2024,14),(2024,'199','나를 소모하지 않는 현명한 태도에 관하여','마티아스 뇔케','퍼스트 펭귄',2024,10),(2025,'104','철학은 날씨를 바꾼다','서동욱','김영사',2024,8),(2026,'181','게으른 완벽주의자를 위한 심리학','헤이든 핀치','시크릿하우스',2022,7),(2027,'189','내면소통','김주환','인플루엔셜',2023,7),(2028,'112','당신이 우주다','디팩 초프라','김영사',2023,5),(2029,'181','도둑맞은 집중력','요한 하리','어크로스',2023,4),(2030,'199','세이노의 가르침','세이노','데이원',2023,3),(2031,'220','내가 틀릴 수도 있습니다','비욘 나티코 린데블라드','다산초당',2022,25),(2032,'222','(2500년 동안 사랑받은) 초역 부처의 말','코이케 류노스케','포레스트북스',2024,24),(2033,'219','(설민석의) 그리스 로마 신화 대모험 .10 , 바다의 신 포세이돈','설민석','Dankkum i',2025,22),(2034,'219','(설민석의) 그리스 로마 신화 대모험 .6 , 가정의 여신 헤라','설민석','Dankkum i',2024,21),(2035,'224','(전현수 박사의) 불교정신치료 강의','전현수','불광출판사',2018,19),(2036,'233','교회를 위한 성서학','안용성','새물결플러스',2024,18),(2037,'233','구술전승과 신약성서','라파엘 로드리게즈','감은사',2024,17),(2038,'219','그리스 로마 신화 .40 , 알렉산드로스와 위대한 원정길','박시연','아울북',2024,15),(2039,'233','마가복음 =The gospel according to Mark','신현우','감은사',2021,14),(2040,'233','예수 그리스도 전기','크레이크 S. 키너','새물결플러스',2022,13),(2043,'350','나라를 위해서 일한다는 거짓말','노한동','Sideways',2024,25),(2044,'327','부자 아빠 가난한 아빠','로버트 기요사키','민음인',2018,24),(2045,'340','지리의 힘','팀 마샬','사이',2016,23),(2046,'373','최재천의 공부','최재천','김영사',2022,21),(2047,'327','(보도 섀퍼의) 돈','보도 섀퍼','에포케',2022,20),(2048,'321','국가는 왜 실패하는가','대런 애쓰모글루','시공사',2012,20),(2049,'332','공정하다는 착각','마이클 샌델','와이즈 베리',2020,17),(2050,'327','돈의 심리학','모건 하우절','인플루엔셜',2021,16),(2051,'327','나의 돈 많은 고등학교 친구','송희구','서삼독',2023,15),(2052,'325','돈은 좋지만 재테크는 겁나는 너에게','뿅글이','BM황금부엉이',2023,13),(2053,'476','이기적 유전자','리처드 도킨스','을유문화사',2018,30),(2054,'443','코스모스 : 특별판','칼 세이건','사이언스북스',2006,30),(2055,'470','물고기는 존재하지 않는다','룰루 밀러','곰출판',2022,29),(2056,'400','(흔한 남매의) 흔한 호기심','흔한 남매 원작','Mirae N 아이세움',2021,29),(2057,'408','놓지 마 과학! .15','신태훈','위즈덤하우스',2023,27),(2058,'420','나 없이는 존재하지 않는 세상','카를로 로벨리','쌤앤파커스',2023,27),(2059,'408','놓지 마 과학! .18','신태훈','위즈덤하우스',2023,26),(2060,'476','다정한 것이 살아남는다','브라이언 헤어','디플롯',2021,26),(2061,'408','로봇 세계에서 살아남기 .3','김정욱','미래앤(MiraeN)',2012,25),(2062,'400','슈뻘맨의 숨은 과학 찾기','슈뻘맨 원작','Mirae N 아이세움',2024,23),(3001,'y','빛과 실','한강','문학과지성사',2025,0),(3002,'y','혼모노','성해나','창비',2025,0),(3003,'100','스토너','존 윌리엄스','알에이치코리아',2015,0);
/*!40000 ALTER TABLE `booktbl` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2025-05-09 11:13:37
